#### RebarDeformationType Enumeration

---

|  |
| --- |
| See Also |

Bar deformation type

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum RebarDeformationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RebarDeformationType ``` |

| Visual C++ |
| --- |
| ``` public enum class RebarDeformationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Deformed | The bar is ribbed. |
| Plain | The bar is not ribbed. |

# See Also

Autodesk.Revit.DB.Structure Namespace